src/Catalogs/Ремонт/Ремонт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Ремонт</name>
  <attributes>
    <name>ВидРемонта</name>
    <type>
      <types>EnumRef.ВидыРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>БарКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапВхода</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственноеЗадание</name>
    <type>
      <types>DocumentRef.ДвижениеМПЗ</types>
      <types>DocumentRef.ПроизводственноеЗадание</types>
      <types>DocumentRef.ВыпускПродукцииКанбан</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратнаяТара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>СтандартныйКомментарий</name>
    <type>
      <types>CatalogRef.КомментарииНеисправностей</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийРемонтника</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтложен</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоНеремонтопригодных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЭлементыРемонта</name>
    <attributes>
      <name>НР</name>
      <type>
        <types>CatalogRef.АналогиНормРасходов</types>
        <types>CatalogRef.НормыРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Позиция</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Элемент</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидНеисправности</name>
      <type>
        <types>CatalogRef.ВидыНеисправностей</types>
      </type>
    </attributes>
    <attributes>
      <name>МТК</name>
      <type>
        <types>DocumentRef.МаршрутнаяКарта</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ДвижениеМПЗ</types>
        <types>DocumentRef.СписаниеМПЗПрочее</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаменаЭлемента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>БракПоставщика</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НовыйЭлемент</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
        <types>CatalogRef.АналогиНормРасходов</types>
        <types>CatalogRef.НормыРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>ОсновнаяЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/СтатусыРемонта/СтатусыРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыРемонта</name>
  <enumValues>
    <name>Ремонт</name>
  </enumValues>
  <enumValues>
    <name>Отложен</name>
  </enumValues>
  <enumValues>
    <name>Окончен</name>
  </enumValues>
  <enumValues>
    <name>Разукомплектовка</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Ремонт/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПроверкаРемонтаНаСервере()
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	Ремонт.ПроизводственноеЗадание,
	|	Ремонт.БарКод
	|ИЗ
	|	Справочник.Ремонт КАК Ремонт
	|ГДЕ
	|	Ремонт.Статус <> &Статус";
Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыРемонта.Окончен);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Отбор = Новый Структура("ПЗ",ВыборкаДетальныеЗаписи.ПроизводственноеЗадание);	
	ЭтапыПЗ = РегистрыСведений.ЭтапыПроизводственныхЗаданий.ПолучитьПоследнее(ТекущаяДата(),Отбор);
		Если ЭтапыПЗ.ДатаОкончания <> Дата(1,1,1) Тогда
		Сообщить("Ремонт изделия "+ВыборкаДетальныеЗаписи.БарКод+" не завершён. "+ВыборкаДетальныеЗаписи.ПроизводственноеЗадание+" - завершено!");
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаРемонта(Команда)
ПроверкаРемонтаНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Функция СписокПередНачаломИзмененияНаСервере()
	Если Не РольДоступна("Администратор")и(Не РольДоступна("Мастер")) Тогда
	Возврат(Истина);
	Иначе
	Возврат(Ложь);	
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
Отказ = СписокПередНачаломИзмененияНаСервере();
КонецПроцедуры
